---
kind: property
id: P:Autodesk.Revit.DB.Part.PartMaker
source: html/67743418-5f84-a6b6-cfcf-14d8072391b1.htm
---
# Autodesk.Revit.DB.Part.PartMaker Property

The PartMaker that created this Part.

## Syntax (C#)
```csharp
public PartMaker PartMaker { get; }
```